app/Controllers/Admin.php

    public function aduan()
    {

        $aduan = $this->AduanModel->findAll();
---
SELECT *
FROM `aduan`

    public function delete_aduan($id)
    {


        $aduan = new AduanModel();
        $aduan->where('id', $id);
        $aduan->delete();
---
DELETE FROM `aduan`
WHERE `id` = '19'