app/Controllers/User.php

SELECT *
FROM `aduan`
---
    public function aduanuser()
    {

        $aduan = $this->AduanModel->findAll();

SELECT *
FROM `aduan`
---
    public function status_aduan()
    {

        $aduan = $this->AduanModel->findAll();